Autodesk.Revit.DB.Electrical.WireMaterialTypeSet
A set that contains wire material types.

Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Insert(Autodesk.Revit.DB.Electrical.WireMaterialType)
System.Int32
Insert the specified wire material type into the set.
item: The wire material type to be inserted into the set.
Returns: Returns whether the wire material type was inserted into the set.

Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.ReverseIterator
Autodesk.Revit.DB.Electrical.WireMaterialTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.ForwardIterator
Autodesk.Revit.DB.Electrical.WireMaterialTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Erase(Autodesk.Revit.DB.Electrical.WireMaterialType)
System.Int32
Removes a specified wire material type from the set.
item: The wire material type to be erased.
Returns: The number of wire material types that were erased from the set.

Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Contains(Autodesk.Revit.DB.Electrical.WireMaterialType)
System.Boolean
Tests for the existence of a wire material type within the set.
item: The wire material type to be searched for.
Returns: The Contains method returns True if the wire material type is within the set, otherwise False.

Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Clear
void
Removes every wire material type from the set, rendering it empty.

Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Size
System.Int32
get
Returns the number of wire material types that are in the set.

Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.